GlomarGadaffi/cermak-peddler/sdkconfig.defaults
# Target SoC. Pinned so a stray sdkconfig regeneration can't silently fall back
# to IDF's default 'esp32' target (which breaks the esp32s3 build: PSRAM, the
# AXS15231B display, and the 16MB layout all assume esp32s3). Without this, an
# `idf.py build` that has to regenerate sdkconfig produces an esp32 config that
# mismatches the CMake cache and aborts.
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3 CPU & Frequency settings
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# SPIRAM (OPI PSRAM) Configurations
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_MEMTEST=n

# Flash Settings (16MB QIO)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Common ESP system settings
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# LVGL Config overrides (if using custom lv_conf.h, or via Kconfig)
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
# AXS15231B QSPI expects byte-swapped RGB565 (the working reference sets swap_bytes=1).
# Without this, bright colors come out near-black because the two bytes are reversed.
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_TICK_CUSTOM=y
CONFIG_LV_TICK_CUSTOM_INCLUDE="esp_timer.h"
CONFIG_LV_TICK_CUSTOM_SYS_TIME_EXPR="esp_timer_get_time() / 1000"

# User requested additions for CI build fix
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA (Phase-1 production hardening) — see docs/OTA.md.
# Enables the bootloader anti-rollback / app-validation workflow so a freshly
# flashed OTA image boots in the "pending verify" state and is rolled back to the
# previous slot on the next reset UNLESS the app calls
# esp_ota_mark_app_valid_cancel_rollback() (we do this on a clean boot via
# OtaUpdater::markValid()). This is the single canonical Kconfig symbol for the
# feature in ESP-IDF v5.x; there is no separate CONFIG_APP_ROLLBACK_ENABLE.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y


# The HTTP dashboard's accept loop runs as a std::thread (pthread). handleClient
# -> sendApiStatus builds a JSON response + snapshot vector copies that overflow
# the 3 KB default pthread stack on-device (works on host where threads have
# MB-sized stacks; that mismatch made the dashboard unreachable on a real LAN
# while SIP, on a properly-sized FreeRTOS task, kept working). Give std::thread
# tasks a realistic stack.
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# wolfSSL (display/SSH build only). The wolfSSL ESP component emits a #warning
# "RSA may be difficult with less than 10KB Stack" when CONFIG_ESP_MAIN_TASK_STACK_SIZE
# < 10500. Under IDF v6.0.1's -Werror=cpp a #warning is a hard error. The wolfSSH
# server runs in its own 24KB task (not the main task) and uses ECC, not RSA, so the
# warning is irrelevant here — suppress it via the wolfSSL-provided Kconfig escape hatch.
# (Harmless/ignored for non-display builds that don't link wolfSSL.)
CONFIG_ESP_WOLFSSL_NO_STACK_SIZE_BUILD_WARNING=y

# lwIP receive mailbox depth (Issue #78, stress-test finding #1).
# The IDF default of 6 overruns under a burst of simultaneous SIP packets from one
# source — the packets are dropped at the lwip layer before the SIP task ever sees
# them (30 parallel REGISTERs measured 0 responses; the same REGISTER sent singly
# succeeds). This board has ample headroom (~200 KB free internal RAM per the
# v1.2.0 size analysis) for the few extra KB this costs. The 4MB/no-PSRAM
# constrained profile (sdkconfig.defaults.esp32_constrained) deliberately keeps
# CONFIG_LWIP_UDP_RECVMBOX_SIZE=6 and is layered on top of this file, so it is
# unaffected.
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32


# ── Task-stack overflow: fail loud, immediately (docs/THREAT_MODEL.md T-7) ──
# The lesson of the UNISOC T612 VoLTE RCE: on an RTOS a parser that spends the
# call stack turns a stack overflow into native code execution, because the
# bytes past the end of one task's stack are another task's stack (and its
# saved return addresses / function pointers). The SIP parser runs on the 16 KB
# udp_receiver_task and is non-recursive and bounded by construction (see
# SipMessage::checkSdp and tests/tools/check_parser_callgraph.py) -- these two
# settings are the backstop for the day a future change forgets that.
#
# WATCHPOINT_END_OF_STACK arms a hardware debug watchpoint on the last 32 bytes
# of every task's stack, so the FIRST write past the end traps into the panic
# handler -- not the next context switch, by which time the neighbour is
# already corrupted (the canary check alone, which stays on, only catches it
# then). Costs one of the two watchpoints (OpenOCD keeps the other).
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
# -fstack-protector-strong: a per-frame canary on every function that holds an
# array or takes a local's address (i.e. every parser frame), verified before
# return. A smashed return address becomes an abort in __stack_chk_fail rather
# than a jump. The code-size cost is a few percent on the parser TUs only.
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y

# ── Heap corruption detection ────────────────────────────────────────────────
# The two settings above cover the STACK. Until now the heap had nothing
# (HEAP_POISONING_DISABLED, the IDF default), which was defensible when the
# hardening focus was the SIP parser's stack recursion (T-7) but is not any
# more: the HTTP plane runs a detached thread per connection, each with a heap
# read buffer, serves a ~55 KB page blob that is copied more than once per
# request, and the display build malloc()s ~19 KB for the QR canvas.
#
# LIGHT adds a canary to each allocation and verifies it on free()/realloc(),
# so a heap overflow or double-free aborts at the next free instead of quietly
# corrupting a neighbour. The cost is a few bytes per allocation and a check on
# a path that is not hot.
#
# Deliberately LIGHT, not COMPREHENSIVE: the latter memsets on every alloc and
# free, which is the wrong trade on a device carrying real-time audio. It lives
# in sdkconfig.defaults.heap_debug for CI and bug hunts instead.
#
# Worth being honest about what this is: a DETECTOR, not a mitigation. The stack
# canary turns a smashed return address into an abort before it is used; heap
# poisoning only notices at the next free(), by which time the corruption has
# been live for a while. It also converts corruption into a reboot on a device
# that may be carrying calls -- which is still better than serving from a
# corrupt heap, but it is a trade, not a free win.
CONFIG_HEAP_POISONING_LIGHT=y
